RIET/src/Catalogs/BORGs/BORGs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BORGs</name>
  <attributes>
    <name>Компания</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultAU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultWH</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>OracleERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>TechnicalDescriptionContacts</name>
    <attributes>
      <name>Contact</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/InformationRegisters/AUsAndBORGs/AUsAndBORGs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AUsAndBORGs</name>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BORG</name>
    <type>
      <types>CatalogRef.BORGs</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/BORGs/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзAUsAndBORGs" Тогда
			НастроитьДляВыбораИзAUsAndBORGs(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);	
		
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзAUsAndBORGs(СтруктураНастройки)
	
	Если ЗначениеЗаполнено(СтруктураНастройки.AU) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("AU", СтруктураНастройки.AU);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	AUsAndBORGs.BORG
			|ИЗ
			|	РегистрСведений.AUsAndBORGs КАК AUsAndBORGs
			|ГДЕ AUsAndBORGs.AU <> &AU";
			
		МассивЗапрещенныхBORGs = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("BORG");
		Если МассивЗапрещенныхBORGs.Количество() Тогда
			
			СписокЗапрещенныхBORGs = Новый СписокЗначений;
			СписокЗапрещенныхBORGs.ЗагрузитьЗначения(МассивЗапрещенныхBORGs);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор,
				"Ссылка",
				СписокЗапрещенныхBORGs,
				ВидСравненияКомпоновкиДанных.НеВСписке,
				,
				Истина);
			
		КонецЕсли; 
				
	КонецЕсли; 
	
КонецПроцедуры
